experiment_logs/10.0.6.1.log
INFO[16 Dec 2019 15:55:58] bootstrapping machine                         gateway=10.0.6.2 ip=10.0.6.1 logfile=10.0.6.1.log num=5
INFO[16 Dec 2019 15:55:58] creating rootfs                               gateway=10.0.6.2 ip=10.0.6.1 num=5
INFO[16 Dec 2019 15:57:27] configured tap interface                      ether="de:26:45:bb:b0:82" tap=5
INFO[16 Dec 2019 15:57:27] VM started                                    pid=31959
INFO[16 Dec 2019 15:57:27] measuring time until web service becomes reachable...  ip=10.0.6.1
INFO[16 Dec 2019 15:57:27] measuring time until network stack becomes available...  ip=10.0.6.1
INFO[16 Dec 2019 15:57:27] SERVICE DOWN:2019-12-16 15:57:27.648754717 +0100 CET m=+88.739114206 
INFO[16 Dec 2019 15:57:28] received ping response                        delta=1.334807591s
INFO[16 Dec 2019 15:57:29] SERVICE UP:200 OK                            
INFO[16 Dec 2019 15:57:29] Time until HTTP reply from webservice:1.461565573s 
INFO[16 Dec 2019 15:57:29] Kernel Boot Time:594.348ms                   
INFO[16 Dec 2019 15:57:29] measuring response time...                    ip=10.0.6.1
INFO[16 Dec 2019 15:57:37] This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.6.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        10.0.6.1
Server Port:            80

Document Path:          /ping
Document Length:        81920 bytes

Concurrency Level:      1
Time taken for tests:   8.236 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      82017000 bytes
HTML transferred:       81920000 bytes
Requests per second:    121.42 [#/sec] (mean)
Time per request:       8.236 [ms] (mean)
Time per request:       8.236 [ms] (mean, across all concurrent requests)
Transfer rate:          9724.97 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.4      1       7
Processing:     3    8   2.8      6      25
Waiting:        1    3   1.2      2      13
Total:          4    8   3.0      7      25

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      8
  75%      9
  80%     10
  90%     13
  95%     15
  98%     16
  99%     18
 100%     25 (longest request) 
INFO[16 Dec 2019 15:57:42] a962e606a7bf7c4ded34479924cba4b4b433bb95aaf8133e98d20cb0965ede1f  /random.data
real	0m 4.86s
user	0m 2.84s
sys	0m 0.71s

random data size:105 MB 
INFO[16 Dec 2019 15:57:42] waiting for VM to exit