experiment_logs/10.0.8.1.log
INFO[16 Dec 2019 15:55:58] bootstrapping machine                         gateway=10.0.8.2 ip=10.0.8.1 logfile=10.0.8.1.log num=7
INFO[16 Dec 2019 15:55:58] creating rootfs                               gateway=10.0.8.2 ip=10.0.8.1 num=7
INFO[16 Dec 2019 15:57:26] configured tap interface                      ether="a6:48:bf:0e:2a:55" tap=7
INFO[16 Dec 2019 15:57:26] VM started                                    pid=31795
INFO[16 Dec 2019 15:57:26] measuring time until web service becomes reachable...  ip=10.0.8.1
INFO[16 Dec 2019 15:57:26] measuring time until network stack becomes available...  ip=10.0.8.1
INFO[16 Dec 2019 15:57:26] SERVICE DOWN:2019-12-16 15:57:26.620829499 +0100 CET m=+87.711188977 
INFO[16 Dec 2019 15:57:27] received ping response                        delta=1.017393948s
INFO[16 Dec 2019 15:57:27] SERVICE UP:200 OK                            
INFO[16 Dec 2019 15:57:27] Time until HTTP reply from webservice:930.262121ms 
INFO[16 Dec 2019 15:57:27] Kernel Boot Time:906.29ms                    
INFO[16 Dec 2019 15:57:27] measuring response time...                    ip=10.0.8.1
INFO[16 Dec 2019 15:57:35] This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.8.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        10.0.8.1
Server Port:            80

Document Path:          /ping
Document Length:        81920 bytes

Concurrency Level:      1
Time taken for tests:   7.592 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      82017000 bytes
HTML transferred:       81920000 bytes
Requests per second:    131.71 [#/sec] (mean)
Time per request:       7.592 [ms] (mean)
Time per request:       7.592 [ms] (mean, across all concurrent requests)
Transfer rate:          10549.43 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      1      15
Processing:     3    7   2.6      6      30
Waiting:        1    3   1.2      2      16
Total:          3    8   2.9      7      30

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      7
  75%      8
  80%      9
  90%     12
  95%     13
  98%     15
  99%     16
 100%     30 (longest request) 
INFO[16 Dec 2019 15:57:40] a962e606a7bf7c4ded34479924cba4b4b433bb95aaf8133e98d20cb0965ede1f  /random.data
real	0m 5.22s
user	0m 2.87s
sys	0m 0.67s

random data size:105 MB 
INFO[16 Dec 2019 15:57:40] waiting for VM to exit