experiment_logs/10.10.1.1.log
INFO[16 Dec 2019 15:46:06] bootstrapping machine                         gateway=10.10.1.2 ip=10.10.1.1 logfile=10.10.1.1.log num=0
INFO[16 Dec 2019 15:46:06] creating rootfs                               gateway=10.10.1.2 ip=10.10.1.1 num=0
INFO[16 Dec 2019 15:46:30] configured tap interface                      ether="ca:9c:89:a1:15:fb" tap=0
INFO[16 Dec 2019 15:46:30] VM started                                    pid=22252
INFO[16 Dec 2019 15:46:30] measuring time until web service becomes reachable...  ip=10.10.1.1
INFO[16 Dec 2019 15:46:30] SERVICE DOWN:2019-12-16 15:46:30.811934608 +0100 CET m=+23.875414198 
INFO[16 Dec 2019 15:46:31] SERVICE UP:200 OK                            
INFO[16 Dec 2019 15:46:31] Time until HTTP reply from webservice:990.322865ms 
INFO[16 Dec 2019 15:46:31] Kernel Boot Time:916.999ms                   
INFO[16 Dec 2019 15:46:31] measuring response time...                    ip=10.10.1.1
INFO[16 Dec 2019 15:46:34] This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.10.1.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        10.10.1.1
Server Port:            80

Document Path:          /ping
Document Length:        81920 bytes

Concurrency Level:      1
Time taken for tests:   2.769 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      82017000 bytes
HTML transferred:       81920000 bytes
Requests per second:    361.20 [#/sec] (mean)
Time per request:       2.769 [ms] (mean)
Time per request:       2.769 [ms] (mean, across all concurrent requests)
Transfer rate:          28930.23 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     2    2   0.3      2       6
Waiting:        1    1   0.2      1       2
Total:          2    3   0.3      3       7

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      3
  80%      3
  90%      3
  95%      3
  98%      3
  99%      4
 100%      7 (longest request) 
INFO[16 Dec 2019 15:46:36] a962e606a7bf7c4ded34479924cba4b4b433bb95aaf8133e98d20cb0965ede1f  /random.data
real	0m 2.05s
user	0m 1.80s
sys	0m 0.24s

random data size:105 MB 
INFO[16 Dec 2019 15:46:36] waiting for VM to exit